###############################################################################
# Created by write_sdc
# Fri Dec  9 20:47:24 2022
###############################################################################
current_design config_reg_mux
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name reg_wr_i -period 50.0000 [get_ports {reg_wr_i}]
set_clock_transition 0.1500 [get_clocks {reg_wr_i}]
set_clock_uncertainty 0.2500 reg_wr_i
set_propagated_clock [get_clocks {reg_wr_i}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {loopback_i}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux0_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux0_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux0_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux0_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux0_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux0_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux1_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux1_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux1_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux1_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux1_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux1_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux2_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux2_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux2_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux2_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux2_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux2_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux3_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux3_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux3_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux3_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux3_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux3_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux4_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux4_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux4_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux4_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux4_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux4_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux5_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux5_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux5_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux5_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux5_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux5_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux6_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux6_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux6_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux6_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux6_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux6_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux7_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux7_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux7_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux7_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux7_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux7_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux_adr_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux_adr_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux_adr_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_adr_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_adr_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_dat_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_dat_i[10]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_dat_i[11]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_dat_i[12]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_dat_i[13]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_dat_i[14]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_dat_i[15]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_dat_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_dat_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_dat_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_dat_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_dat_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_dat_i[6]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_dat_i[7]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_dat_i[8]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg_dat_i[9]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {rst_n_i}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_dac_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_dac_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_dac_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_dac_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_dac_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_dac_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_ticks_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_ticks_i[10]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_ticks_i[11]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_ticks_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_ticks_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_ticks_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_ticks_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_ticks_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_ticks_i[6]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_ticks_i[7]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_ticks_i[8]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp0_ticks_i[9]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_dac_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_dac_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_dac_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_dac_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_dac_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_dac_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_ticks_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_ticks_i[10]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_ticks_i[11]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_ticks_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_ticks_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_ticks_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_ticks_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_ticks_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_ticks_i[6]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_ticks_i[7]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_ticks_i[8]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp1_ticks_i[9]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_dac_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_dac_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_dac_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_dac_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_dac_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_dac_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_ticks_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_ticks_i[10]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_ticks_i[11]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_ticks_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_ticks_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_ticks_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_ticks_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_ticks_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_ticks_i[6]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_ticks_i[7]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_ticks_i[8]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp2_ticks_i[9]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_dac_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_dac_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_dac_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_dac_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_dac_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_dac_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_ticks_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_ticks_i[10]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_ticks_i[11]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_ticks_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_ticks_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_ticks_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_ticks_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_ticks_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_ticks_i[6]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_ticks_i[7]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_ticks_i[8]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp3_ticks_i[9]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_sel_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_sel_i[1]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {loopback_o}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux_o[0]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux_o[1]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux_o[2]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux_o[3]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux_o[4]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {mux_o[5]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg0_o[0]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg0_o[10]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg0_o[11]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg0_o[12]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg0_o[13]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg0_o[14]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg0_o[15]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg0_o[1]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg0_o[2]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg0_o[3]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg0_o[4]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg0_o[5]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg0_o[6]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg0_o[7]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg0_o[8]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg0_o[9]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg1_o[0]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg1_o[10]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg1_o[11]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg1_o[12]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg1_o[13]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg1_o[14]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg1_o[15]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg1_o[1]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg1_o[2]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg1_o[3]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg1_o[4]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg1_o[5]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg1_o[6]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg1_o[7]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg1_o[8]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg1_o[9]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg2_o[0]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg2_o[10]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg2_o[11]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg2_o[12]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg2_o[13]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg2_o[14]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg2_o[15]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg2_o[1]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg2_o[2]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg2_o[3]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg2_o[4]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg2_o[5]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg2_o[6]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg2_o[7]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg2_o[8]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg2_o[9]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg3_o[0]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg3_o[10]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg3_o[11]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg3_o[12]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg3_o[13]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg3_o[14]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg3_o[15]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg3_o[1]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg3_o[2]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg3_o[3]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg3_o[4]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg3_o[5]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg3_o[6]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg3_o[7]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg3_o[8]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {reg3_o[9]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_dac_o[0]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_dac_o[1]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_dac_o[2]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_dac_o[3]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_dac_o[4]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_dac_o[5]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_ticks_o[0]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_ticks_o[10]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_ticks_o[11]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_ticks_o[1]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_ticks_o[2]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_ticks_o[3]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_ticks_o[4]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_ticks_o[5]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_ticks_o[6]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_ticks_o[7]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_ticks_o[8]}]
set_output_delay 10.0000 -clock [get_clocks {reg_wr_i}] -add_delay [get_ports {temp_ticks_o[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {loopback_o}]
set_load -pin_load 0.0334 [get_ports {mux_o[5]}]
set_load -pin_load 0.0334 [get_ports {mux_o[4]}]
set_load -pin_load 0.0334 [get_ports {mux_o[3]}]
set_load -pin_load 0.0334 [get_ports {mux_o[2]}]
set_load -pin_load 0.0334 [get_ports {mux_o[1]}]
set_load -pin_load 0.0334 [get_ports {mux_o[0]}]
set_load -pin_load 0.0334 [get_ports {reg0_o[15]}]
set_load -pin_load 0.0334 [get_ports {reg0_o[14]}]
set_load -pin_load 0.0334 [get_ports {reg0_o[13]}]
set_load -pin_load 0.0334 [get_ports {reg0_o[12]}]
set_load -pin_load 0.0334 [get_ports {reg0_o[11]}]
set_load -pin_load 0.0334 [get_ports {reg0_o[10]}]
set_load -pin_load 0.0334 [get_ports {reg0_o[9]}]
set_load -pin_load 0.0334 [get_ports {reg0_o[8]}]
set_load -pin_load 0.0334 [get_ports {reg0_o[7]}]
set_load -pin_load 0.0334 [get_ports {reg0_o[6]}]
set_load -pin_load 0.0334 [get_ports {reg0_o[5]}]
set_load -pin_load 0.0334 [get_ports {reg0_o[4]}]
set_load -pin_load 0.0334 [get_ports {reg0_o[3]}]
set_load -pin_load 0.0334 [get_ports {reg0_o[2]}]
set_load -pin_load 0.0334 [get_ports {reg0_o[1]}]
set_load -pin_load 0.0334 [get_ports {reg0_o[0]}]
set_load -pin_load 0.0334 [get_ports {reg1_o[15]}]
set_load -pin_load 0.0334 [get_ports {reg1_o[14]}]
set_load -pin_load 0.0334 [get_ports {reg1_o[13]}]
set_load -pin_load 0.0334 [get_ports {reg1_o[12]}]
set_load -pin_load 0.0334 [get_ports {reg1_o[11]}]
set_load -pin_load 0.0334 [get_ports {reg1_o[10]}]
set_load -pin_load 0.0334 [get_ports {reg1_o[9]}]
set_load -pin_load 0.0334 [get_ports {reg1_o[8]}]
set_load -pin_load 0.0334 [get_ports {reg1_o[7]}]
set_load -pin_load 0.0334 [get_ports {reg1_o[6]}]
set_load -pin_load 0.0334 [get_ports {reg1_o[5]}]
set_load -pin_load 0.0334 [get_ports {reg1_o[4]}]
set_load -pin_load 0.0334 [get_ports {reg1_o[3]}]
set_load -pin_load 0.0334 [get_ports {reg1_o[2]}]
set_load -pin_load 0.0334 [get_ports {reg1_o[1]}]
set_load -pin_load 0.0334 [get_ports {reg1_o[0]}]
set_load -pin_load 0.0334 [get_ports {reg2_o[15]}]
set_load -pin_load 0.0334 [get_ports {reg2_o[14]}]
set_load -pin_load 0.0334 [get_ports {reg2_o[13]}]
set_load -pin_load 0.0334 [get_ports {reg2_o[12]}]
set_load -pin_load 0.0334 [get_ports {reg2_o[11]}]
set_load -pin_load 0.0334 [get_ports {reg2_o[10]}]
set_load -pin_load 0.0334 [get_ports {reg2_o[9]}]
set_load -pin_load 0.0334 [get_ports {reg2_o[8]}]
set_load -pin_load 0.0334 [get_ports {reg2_o[7]}]
set_load -pin_load 0.0334 [get_ports {reg2_o[6]}]
set_load -pin_load 0.0334 [get_ports {reg2_o[5]}]
set_load -pin_load 0.0334 [get_ports {reg2_o[4]}]
set_load -pin_load 0.0334 [get_ports {reg2_o[3]}]
set_load -pin_load 0.0334 [get_ports {reg2_o[2]}]
set_load -pin_load 0.0334 [get_ports {reg2_o[1]}]
set_load -pin_load 0.0334 [get_ports {reg2_o[0]}]
set_load -pin_load 0.0334 [get_ports {reg3_o[15]}]
set_load -pin_load 0.0334 [get_ports {reg3_o[14]}]
set_load -pin_load 0.0334 [get_ports {reg3_o[13]}]
set_load -pin_load 0.0334 [get_ports {reg3_o[12]}]
set_load -pin_load 0.0334 [get_ports {reg3_o[11]}]
set_load -pin_load 0.0334 [get_ports {reg3_o[10]}]
set_load -pin_load 0.0334 [get_ports {reg3_o[9]}]
set_load -pin_load 0.0334 [get_ports {reg3_o[8]}]
set_load -pin_load 0.0334 [get_ports {reg3_o[7]}]
set_load -pin_load 0.0334 [get_ports {reg3_o[6]}]
set_load -pin_load 0.0334 [get_ports {reg3_o[5]}]
set_load -pin_load 0.0334 [get_ports {reg3_o[4]}]
set_load -pin_load 0.0334 [get_ports {reg3_o[3]}]
set_load -pin_load 0.0334 [get_ports {reg3_o[2]}]
set_load -pin_load 0.0334 [get_ports {reg3_o[1]}]
set_load -pin_load 0.0334 [get_ports {reg3_o[0]}]
set_load -pin_load 0.0334 [get_ports {temp_dac_o[5]}]
set_load -pin_load 0.0334 [get_ports {temp_dac_o[4]}]
set_load -pin_load 0.0334 [get_ports {temp_dac_o[3]}]
set_load -pin_load 0.0334 [get_ports {temp_dac_o[2]}]
set_load -pin_load 0.0334 [get_ports {temp_dac_o[1]}]
set_load -pin_load 0.0334 [get_ports {temp_dac_o[0]}]
set_load -pin_load 0.0334 [get_ports {temp_ticks_o[11]}]
set_load -pin_load 0.0334 [get_ports {temp_ticks_o[10]}]
set_load -pin_load 0.0334 [get_ports {temp_ticks_o[9]}]
set_load -pin_load 0.0334 [get_ports {temp_ticks_o[8]}]
set_load -pin_load 0.0334 [get_ports {temp_ticks_o[7]}]
set_load -pin_load 0.0334 [get_ports {temp_ticks_o[6]}]
set_load -pin_load 0.0334 [get_ports {temp_ticks_o[5]}]
set_load -pin_load 0.0334 [get_ports {temp_ticks_o[4]}]
set_load -pin_load 0.0334 [get_ports {temp_ticks_o[3]}]
set_load -pin_load 0.0334 [get_ports {temp_ticks_o[2]}]
set_load -pin_load 0.0334 [get_ports {temp_ticks_o[1]}]
set_load -pin_load 0.0334 [get_ports {temp_ticks_o[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {loopback_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wr_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux0_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux0_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux0_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux0_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux0_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux0_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux1_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux1_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux1_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux1_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux1_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux1_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux2_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux2_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux2_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux2_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux2_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux2_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux3_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux3_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux3_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux3_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux3_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux3_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux4_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux4_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux4_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux4_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux4_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux4_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux5_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux5_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux5_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux5_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux5_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux5_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux6_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux6_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux6_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux6_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux6_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux6_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux7_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux7_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux7_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux7_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux7_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux7_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux_adr_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux_adr_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mux_adr_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_adr_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_adr_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_dat_i[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_dat_i[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_dat_i[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_dat_i[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_dat_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_dat_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_dat_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_dat_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_dat_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_dat_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_dat_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_dat_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_dat_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_dat_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_dat_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_dat_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_dac_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_dac_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_dac_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_dac_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_dac_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_dac_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_ticks_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_ticks_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_ticks_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_ticks_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_ticks_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_ticks_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_ticks_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_ticks_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_ticks_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_ticks_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_ticks_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp0_ticks_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_dac_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_dac_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_dac_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_dac_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_dac_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_dac_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_ticks_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_ticks_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_ticks_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_ticks_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_ticks_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_ticks_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_ticks_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_ticks_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_ticks_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_ticks_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_ticks_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp1_ticks_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_dac_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_dac_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_dac_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_dac_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_dac_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_dac_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_ticks_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_ticks_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_ticks_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_ticks_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_ticks_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_ticks_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_ticks_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_ticks_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_ticks_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_ticks_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_ticks_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp2_ticks_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_dac_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_dac_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_dac_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_dac_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_dac_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_dac_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_ticks_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_ticks_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_ticks_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_ticks_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_ticks_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_ticks_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_ticks_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_ticks_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_ticks_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_ticks_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_ticks_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp3_ticks_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp_sel_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {temp_sel_i[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
